{
    "blogs": [
        {
            "title": "My first blog",
            "author": "George Orwell",
            "body": "As I sit down to write my very first blog post, I find myself reflecting on the journey that has brought me here. Life is a series of twists and turns, unexpected detours, and breathtaking vistas. And through it all, one thing remains constant",
            "id": "1"
        },
        {
            "title": "Javascript programming",
            "author": "H.K. Henry",
            "body": "Javascript is a dynamically typed language, meaning that the data type of a variable can change during the execution of a program. This can be both a strength and a weakness, as it can lead to more flexible and expressive code, but it can also lead to unexpected behavior if not handled correctly.",
            "id": "2"
        },
        {
            "title" : "Python or Ruby? Which should I learn?",
            "author" : "Charles Dickens", 
            "body" : "For example, in terms of variables, both Ruby and Python declare and assign variables in the same simple way, but they differ slightly in terms of data types. Ruby generally uses arrays or hashes to display a collection of data, while Python uses lists or dictionaries. When accessing items from an array or list, Ruby and Python are generally the same, but they differ in the symbol used to take a range of items. Ruby uses ... and Python uses :, with Python's being exclusive and Ruby's being inclusive.",
            "id": "3"
        },
        {
            "title" : "A question about RESTful APIs",
            "author" : "J.K. Rowling", 
            "body" : "REST (Representational State Transfer is an architectural style for building web services that allows for the creation, retrieval, updating, and deletion of resources over the HTTP protocol. A RESTful API is a web service that adheres to the principles of REST.",
            "id" :"4"
        },
        {
            "title" : "Using Markdown for writing blog posts",
            "author" : "A.H. Mohamed", 
            "body" : "Markdown is easy Markdown is a lightweight markup language that is commonly used for writing blog posts, documentation, and other types of text-based content. It is designed to be easy to read and write, with a simple syntax that allows you to format text without the need for complex HTML tagsto use and produces clean HTML output.",
            "id" : "5"
        }
    ]
}